# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [2]:
# Your code goes here
import pandas as pd
url_1 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
url_2 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
url_3 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'
df_1 = pd.read_csv(url_1)
df_2 = pd.read_csv(url_2)
df_3 = pd.read_csv(url_3)

##### Option 1: first combine the three datasets and then apply the cleaning function to the new combined dataset

In [3]:
df_1

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df_1.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [5]:
df_1.columns = df_1.columns.str.replace(" ","_")

In [6]:
df_1.rename(columns={'ST': 'State'}, inplace=True)

In [7]:
df_1.rename(columns={'GENDER': 'Gender'}, inplace=True)

In [8]:
df_1.columns

Index(['Customer', 'State', 'Gender', 'Education', 'Customer_Lifetime_Value',
       'Income', 'Monthly_Premium_Auto', 'Number_of_Open_Complaints',
       'Policy_Type', 'Vehicle_Class', 'Total_Claim_Amount'],
      dtype='object')

In [9]:
df_2

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.600000,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.200000,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.600000,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.200000,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.200000,Corporate Auto,Two-Door Car
...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,Arizona,M,Master,847141.75%,63513,70,1/0/00,185.667213,Personal Auto,Four-Door Car
992,BS91566,Arizona,F,College,543121.91%,58161,68,1/0/00,140.747286,Corporate Auto,Four-Door Car
993,IL40123,Nevada,F,College,568964.41%,83640,70,1/0/00,471.050488,Corporate Auto,Two-Door Car
994,MY32149,California,F,Master,368672.38%,0,96,1/0/00,28.460568,Personal Auto,Two-Door Car
995,SA91515,California,M,Bachelor,399258.39%,0,111,1/0/00,700.349052,Personal Auto,SUV

In [10]:
df_2.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')

In [11]:
df_2.columns = df_2.columns.str.replace(" ","_")

In [12]:
df_2.rename(columns={'ST': 'State'}, inplace=True)

In [13]:
df_2.rename(columns={'GENDER': 'Gender'}, inplace=True)

In [14]:
df_2.columns

Index(['Customer', 'State', 'Gender', 'Education', 'Customer_Lifetime_Value',
       'Income', 'Monthly_Premium_Auto', 'Number_of_Open_Complaints',
       'Total_Claim_Amount', 'Policy_Type', 'Vehicle_Class'],
      dtype='object')

In [15]:
df_3

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,23405.987980,Bachelor,M,71941,73,0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3096.511217,College,F,21604,79,0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8163.890428,Bachelor,M,0,85,3,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7524.442436,College,M,21941,96,0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2611.836866,College,M,0,77,0,Corporate Auto,369.600000,Two-Door Car

In [16]:
df_3.columns

Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [17]:
df_3.columns = df_3.columns.str.replace(" ","_")

In [18]:
df_3.rename(columns={'GENDER': 'Gender'}, inplace=True)

In [19]:
df_3.columns

Index(['Customer', 'State', 'Customer_Lifetime_Value', 'Education', 'Gender',
       'Income', 'Monthly_Premium_Auto', 'Number_of_Open_Complaints',
       'Policy_Type', 'Total_Claim_Amount', 'Vehicle_Class'],
      dtype='object')

##### Building concatenated DataFrame

In [20]:
df = pd.concat([df_1,df_2,df_3], axis=0)
df.columns

Index(['Customer', 'State', 'Gender', 'Education', 'Customer_Lifetime_Value',
       'Income', 'Monthly_Premium_Auto', 'Number_of_Open_Complaints',
       'Policy_Type', 'Vehicle_Class', 'Total_Claim_Amount'],
      dtype='object')

In [21]:
df.columns = df.columns.str.lower()
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

##### Cleaning concatenated DataFrame

###### Changing columns names

In [22]:
# Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".
mapping = {
    'Male' : 'M',  # Replace 'Male' with 'M'
    'female': 'F',  # Replace 'female' with 'F'
    'Femal' : 'F',  # Replace 'Femal' with 'F'
}

# Replace values in the 'gender' column using the mapping dictionary
df['gender'] = df['gender'].replace(mapping)
df['gender']

0       NaN
1         F
2         F
3         M
4         M
       ...
7065      M
7066      F
7067      M
7068      M
7069      M
Name: gender, Length: 12074, dtype: object

In [23]:
# State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"
mapping = {
    'AZ' : 'Arizona',  # Replace 'AZ' with 'Arizona'
    'Cali': 'California',  # Replace 'Cali' with 'California'
    'WA' : 'Washington',  # Replace 'AZ' with 'Arizona'
}

# Replace values in the 'state' column using the mapping dictionary
df['state'] = df['state'].replace(mapping)
df['state']

0       Washington
1          Arizona
2           Nevada
3       California
4       Washington
           ...
7065    California
7066    California
7067    California
7068    California
7069    California
Name: state, Length: 12074, dtype: object

In [24]:
# In education, "Bachelors" could be replaced by "Bachelor"
mapping = {
    'Bachelors' : 'Bachelor',  # Replace 'Bachelors' with 'Bachelor'
}

# Replace values in the 'Bachelors' column using the mapping dictionary
df['education'] = df['education'].replace(mapping)
df['education']

0                     Master
1                   Bachelor
2                   Bachelor
3                   Bachelor
4       High School or Below
                ...
7065                Bachelor
7066                 College
7067                Bachelor
7068                 College
7069                 College
Name: education, Length: 12074, dtype: object

In [25]:
# In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"
mapping = {
    'Sports Car' : 'Luxury',  # Replace 'Sports Car' with 'Luxury'
    'Luxury SUV' : 'Luxury',  # Replace 'Luxury SUV' with 'Luxury'
    'Luxury Car' : 'Luxury',  # Replace 'Luxury Car' with 'Luxury' 
}

# Replace values in the 'vehicle_class' column using the mapping dictionary
df['vehicle_class'] = df['vehicle_class'].replace(mapping)
df['vehicle_class']

0       Four-Door Car
1       Four-Door Car
2        Two-Door Car
3                 SUV
4       Four-Door Car
            ...
7065    Four-Door Car
7066    Four-Door Car
7067    Four-Door Car
7068    Four-Door Car
7069     Two-Door Car
Name: vehicle_class, Length: 12074, dtype: object

In [26]:
# Cleaning the % in customer_lifetime_value
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.rstrip('%')

In [27]:
# Handle missing values by filling NaN with 0 (or any other appropriate value)
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(0)  # Replace NaN with 0

In [28]:
# Change customer_lifetime_value data type
df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)

In [29]:
# Number of open complaints has an incorrect format.
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.lstrip('1/')
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.rstrip('/00')

In [30]:
# Handle missing values by filling NaN with 0 (or any other appropriate value)
df['number_of_open_complaints'] = df['number_of_open_complaints'].fillna(0)  # Replace NaN with 0

In [31]:
# I need to replace blank row values for 0 in my df
df['number_of_open_complaints'] = df['number_of_open_complaints'].replace('', 0)

In [32]:
# Change customer_lifetime_value data type
df['number_of_open_complaints'] = df['number_of_open_complaints'].astype(int)

In [33]:
# Correct the data types of these columns
df['customer'] = df['customer'].astype('category')
df['state'] = df['state'].astype('category')
df['gender'] = df['gender'].astype('category')
df['education'] = df['education'].astype('category')
df['policy_type'] = df['policy_type'].astype('category')
df['vehicle_class'] = df['vehicle_class'].astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12074 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   category
 1   state                      9137 non-null   category
 2   gender                     9015 non-null   category
 3   education                  9137 non-null   category
 4   customer_lifetime_value    12074 non-null  float64
 5   income                     9137 non-null   float64
 6   monthly_premium_auto       9137 non-null   float64
 7   number_of_open_complaints  12074 non-null  int32
 8   policy_type                9137 non-null   category
 9   vehicle_class              9137 non-null   category
 10  total_claim_amount         9137 non-null   float64
dtypes: category(6), float64(4), int32(1)
memory usage: 931.0 KB

In [34]:
# Identify any columns with null or missing values. 
df.isnull().sum()

customer                     2937
state                        2937
gender                       3059
education                    2937
customer_lifetime_value         0
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [35]:
# Drop the rows or columns with null values
df.dropna(axis=0, inplace=True)

In [36]:
df.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [37]:
# Deleting duplicates in the dataframe
df.duplicated().sum()

7

In [38]:
df.drop_duplicates()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,Bachelor,825629.78,62902.0,69.0,0,Personal Auto,Two-Door Car,159.383042
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,0.00,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,0.00,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,0.00,0.0,85.0,0,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,0.00,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,0.00,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [44]:
# Your code goes here
import pandas as pd
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv"
df_marketing_customer_analysis = pd.read_csv(url)
df_marketing_customer_analysis.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

In [45]:
# Correct the data types of these columns
df_marketing_customer_analysis['customer'] = df_marketing_customer_analysis['customer'].astype('category')
df_marketing_customer_analysis['state'] = df_marketing_customer_analysis['state'].astype('category')

df_marketing_customer_analysis['response'] = df_marketing_customer_analysis['response'].astype('category')
df_marketing_customer_analysis['coverage'] = df_marketing_customer_analysis['coverage'].astype('category')
df_marketing_customer_analysis['education'] = df_marketing_customer_analysis['education'].astype('category')

df_marketing_customer_analysis['effective_to_date'] = df_marketing_customer_analysis['effective_to_date'].astype('category')
df_marketing_customer_analysis['employmentstatus'] = df_marketing_customer_analysis['employmentstatus'].astype('category')
df_marketing_customer_analysis['gender'] = df_marketing_customer_analysis['gender'].astype('category')

df_marketing_customer_analysis['location_code'] = df_marketing_customer_analysis['location_code'].astype('category')
df_marketing_customer_analysis['marital_status'] = df_marketing_customer_analysis['marital_status'].astype('category')
df_marketing_customer_analysis['policy_type'] = df_marketing_customer_analysis['policy_type'].astype('category')
df_marketing_customer_analysis['policy'] = df_marketing_customer_analysis['policy'].astype('category')
df_marketing_customer_analysis['renew_offer_type'] = df_marketing_customer_analysis['renew_offer_type'].astype('category')
df_marketing_customer_analysis['sales_channel'] = df_marketing_customer_analysis['sales_channel'].astype('category')
df_marketing_customer_analysis['vehicle_class'] = df_marketing_customer_analysis['vehicle_class'].astype('category')
df_marketing_customer_analysis['vehicle_size'] = df_marketing_customer_analysis['vehicle_size'].astype('category')
df_marketing_customer_analysis['vehicle_type'] = df_marketing_customer_analysis['vehicle_type'].astype('category')

df_marketing_customer_analysis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   unnamed:_0                     10910 non-null  int64
 1   customer                       10910 non-null  category
 2   state                          10910 non-null  category
 3   customer_lifetime_value        10910 non-null  float64
 4   response                       10910 non-null  category
 5   coverage                       10910 non-null  category
 6   education                      10910 non-null  category
 7   effective_to_date              10910 non-null  category
 8   employmentstatus               10910 non-null  category
 9   gender                         10910 non-null  category
 10  income                         10910 non-null  int64
 11  location_code                  10910 non-null  category
 12  marital_status                 10910 non-null  category
 13  monthly_premium_auto           10910 non-null  int64
 14  months_since_last_claim        10910 non-null  float64
 15  months_since_policy_inception  10910 non-null  int64
 16  number_of_open_complaints      10910 non-null  float64
 17  number_of_policies             10910 non-null  int64
 18  policy_type                    10910 non-null  category
 19  policy                         10910 non-null  category
 20  renew_offer_type               10910 non-null  category
 21  sales_channel                  10910 non-null  category
 22  total_claim_amount             10910 non-null  float64
 23  vehicle_class                  10910 non-null  category
 24  vehicle_size                   10910 non-null  category
 25  vehicle_type                   10910 non-null  category
 26  month                          10910 non-null  int64
dtypes: category(17), float64(4), int64(6)
memory usage: 1.3 MB

In [46]:
df_marketing_customer_analysis['sales_channel'].value_counts()

sales_channel
Agent          4121
Branch         3022
Call Center    2141
Web            1626
Name: count, dtype: int64

##### Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [10]:
df_marketing_customer_analysis.isnull().sum()

unnamed:_0                       0
customer                         0
state                            0
customer_lifetime_value          0
response                         0
coverage                         0
education                        0
effective_to_date                0
employmentstatus                 0
gender                           0
income                           0
location_code                    0
marital_status                   0
monthly_premium_auto             0
months_since_last_claim          0
months_since_policy_inception    0
number_of_open_complaints        0
number_of_policies               0
policy_type                      0
policy                           0
renew_offer_type                 0
sales_channel                    0
total_claim_amount               0
vehicle_class                    0
vehicle_size                     0
vehicle_type                     0
month                            0
dtype: int64

In [11]:
df_marketing_customer_analysis.duplicated().sum()

0

In [48]:
# Pivot the DataFrame to see the GDP based on the country and year
pivot_df_income = df_marketing_customer_analysis.pivot_table(index='coverage', columns='sales_channel', values=['income'], aggfunc='sum')

In [49]:
pivot_df_income

                 income
sales_channel     Agent    Branch Call Center       Web
coverage
Basic          92850525  70147997    50821981  38299109
Extended       45480779  32468700    22868264  18215760
Premium        14158848  11158911     7364759   5685234

In [50]:
round(pivot_df_income.describe(),2)

                    income
sales_channel        Agent       Branch  Call Center          Web
count                 3.00         3.00         3.00         3.00
mean           50830050.67  37925202.67  27018334.67  20733367.67
std            39617622.82  29870690.20  22023847.32  16452050.69
min            14158848.00  11158911.00   7364759.00   5685234.00
25%            29819813.50  21813805.50  15116511.50  11950497.00
50%            45480779.00  32468700.00  22868264.00  18215760.00
75%            69165652.00  51308348.50  36845122.50  28257434.50
max            92850525.00  70147997.00  50821981.00  38299109.00

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [51]:
# Pivot the DataFrame to see the GDP based on the country and year
pivot_df_gender = df_marketing_customer_analysis.pivot_table(index='gender', columns='education', values=['customer_lifetime_value'], aggfunc='sum')

In [57]:
round(pivot_df_gender,2)

          customer_lifetime_value                           \
education                Bachelor      College      Doctor
gender
F                     13386258.11  12460107.91  1465701.78
M                     12110061.83  12851725.02  1490482.06


education High School or Below      Master
gender
F                  13793600.12  3874600.25
M                  12680914.19  3365559.06

In [54]:
round(pivot_df_gender.describe(),2)

          customer_lifetime_value                           \
education                Bachelor      College      Doctor
count                        2.00         2.00        2.00
mean                  12748159.97  12655916.46  1478091.92
std                     902407.04    276915.12    17522.30
min                   12110061.83  12460107.91  1465701.78
25%                   12429110.90  12558012.19  1471896.85
50%                   12748159.97  12655916.46  1478091.92
75%                   13067209.04  12753820.74  1484286.99
max                   13386258.11  12851725.02  1490482.06


education High School or Below      Master
count                     2.00        2.00
mean               13237257.15  3620079.65
std                  786787.77   359946.48
min                12680914.19  3365559.06
25%                12959085.67  3492819.35
50%                13237257.15  3620079.65
75%                13515428.64  3747339.95
max                13793600.12  3874600.25

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [ ]:
# Your code goes here